In [2]:
# NA -> not available

import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
# None 值在对象数组中也可以作为NA
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [14]:
# 滤除缺失数据
# 方法有很多 可以通过pandas.isnull或布尔索引的手工方法
# 但dropna可能会更实用一些
# 对于一个Series,dropna返回一个仅含非空数据和索引值的Series

In [16]:
from numpy import nan as NA

In [17]:
data = pd.Series([1,NA,3.5,NA,7])

In [19]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [20]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
# 等价于

data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [22]:
# 对于DataFrame对象,事情有点复杂
# 人们可能希望丢弃全NA或含有NA的行或列
# dropna默认丢弃任何含有缺失值的行

In [23]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])

In [24]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
cleaned = data.dropna()

In [26]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [29]:
# 传入how='all' 则只丢弃那些全为NA的行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data[4] = NA

In [41]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [42]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [44]:
df = pd.DataFrame(np.random.randn(7,3))

In [45]:
df

          0         1         2
0  1.500473  1.218711 -0.144570
1  1.448179  0.392808  1.329655
2 -1.157101 -0.474633 -1.217545
3  0.676702  0.982188 -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [46]:
df.iloc[:4,1]

0    1.218711
1    0.392808
2   -0.474633
3    0.982188
Name: 1, dtype: float64

In [47]:
df.iloc[:4,1] = NA

In [48]:
df.iloc[:2,2] = NA

In [49]:
df

          0         1         2
0  1.500473       NaN       NaN
1  1.448179       NaN       NaN
2 -1.157101       NaN -1.217545
3  0.676702       NaN -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [50]:
df.dropna()

          0         1         2
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [51]:
df.dropna(thresh=2)

          0         1         2
2 -1.157101       NaN -1.217545
3  0.676702       NaN -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [52]:
# 填充缺失数据
# fillna方法是最主要的函数。通过一个常数调用fillna就会将缺失值替换为那个常数值
df.fillna(0)

          0         1         2
0  1.500473  0.000000  0.000000
1  1.448179  0.000000  0.000000
2 -1.157101  0.000000 -1.217545
3  0.676702  0.000000 -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [53]:
# 若通过一个字典调用fillna,就可以实现对不同的列填充不同的值

df.fillna({1:0.5,2:0})

          0         1         2
0  1.500473  0.500000  0.000000
1  1.448179  0.500000  0.000000
2 -1.157101  0.500000 -1.217545
3  0.676702  0.500000 -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [54]:
df

          0         1         2
0  1.500473       NaN       NaN
1  1.448179       NaN       NaN
2 -1.157101       NaN -1.217545
3  0.676702       NaN -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [59]:
df[:3][0] = NA

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [60]:
df

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       NaN       NaN -1.217545
3  0.676702       NaN -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [61]:
df.fillna({1:0.5,2:0.})

          0         1         2
0       NaN  0.500000  0.000000
1       NaN  0.500000  0.000000
2       NaN  0.500000 -1.217545
3  0.676702  0.500000 -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [62]:
_ = df.fillna(0,inplace=True)

In [63]:
df

          0         1         2
0  0.000000  0.000000  0.000000
1  0.000000  0.000000  0.000000
2  0.000000  0.000000 -1.217545
3  0.676702  0.000000 -0.379264
4 -1.933453  1.175469 -0.934898
5 -0.306665 -0.221165 -0.974964
6  1.428933 -0.403983  0.410263

In [64]:
# 数据转换

In [78]:
# 移除重复数据
# DataFrame的duplicated方法返回一个布尔型Series,表示各行是否是重复行

In [67]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [68]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [69]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [70]:
# drop_duplicates方法会丢掉重复项

In [71]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
# 这两个方法会默认判断全部列,但可以指定部分列进行重复项判断

In [73]:
data['v1'] = range(7)

In [74]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [76]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [77]:
# duplicate和drop_duplicates默认保留第一个出现的值组合
# 传入keep='last'则保留最后一个

data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [79]:
# 利用函数或映射进行数据转换

In [80]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   ....:                               'Pastrami', 'corned beef', 'Bacon',
   ....:                               'pastrami', 'honey ham', 'nova lox'],
   ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [81]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [82]:
# 假设想添加一列表示该肉类食物来源的动物类型
# 我们先编写一个不同肉类到动物的映射

meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [83]:
lowercased = data['food'].str.lower()

In [84]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [85]:
data['animal'] = lowercased.map(meat_to_animal)

In [86]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [87]:
# 可以使用lambda函数完成这些工作

data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [88]:
# 替换值

In [90]:
# 利用fillna方法填充确实数据可以看做值替换的一种特殊情况
# map可用于修改对象的数据子集,而replace则提供了一种实现该功能的更简单、灵活的方式

In [137]:
data = pd.Series([1.,-999,2.,-999,-1000,3.])

In [92]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [93]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [94]:
# 如果希望一次替换多个值,可以传入一个由待替换值组成的列表以及一个替换值

In [95]:
data.replace([-999,-1000],NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [145]:
data.replace(data[data < -998],NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [101]:
# 要让每个值有不同的替换值,可以传递一个替换列表

data.replace([-999,-1000],[NA,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [102]:
# 也可以传入字典
data.replace({-999:NA,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [107]:
# 重命名轴索引
# 跟Series中的值一样,轴标签也可以通过函数或映射进行转换


data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                     index=['Ohio', 'Colorado', 'New York'],
                      columns=['one', 'two', 'three', 'four'])

In [106]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [112]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [114]:
# 可以将其赋值给index,进行就地修改
data.index = data.index.map(transform)

In [115]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [116]:
# 如果想要创建数据集的转换版(而不是修改原始数据)
# 比较实用的方法是rename

data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [117]:
# rename可以结合字典型对象实现对部分轴标签的更新

data.rename(index = {'OHIO' :'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [118]:
# 离散化和面元划分
# 为了便于分析,连续数据常常被离散化或拆分为面元

In [119]:
 ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [120]:
# 将这些数据划分为"18到25"、"26到35"、"35到60"、"60以上"几个面元
# 需要实用pandas的cut函数

In [121]:
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)

In [122]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [124]:
# pandas返回的是一个特殊的Categorical对象.结果展示了pandas.cut划分的面元
# 你可以将其看做一组表示面元名称的字符串
# 它的底层含有一个表示不同分类名称的类型数组
# 和一个codes属性中的年龄数据的标签

In [125]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [126]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [127]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [128]:
# 你可以传递一个列表或数组到labels,设置自己的面元名称

group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [129]:
# 如果向cut传入的是面元的数量而不是确切的面元边界,则它会根据数据的最小值和最大值计算等长面元

data = np.random.rand(20)

In [130]:
pd.cut(data,4,precision=2)

[(0.74, 0.98], (0.019, 0.26], (0.019, 0.26], (0.5, 0.74], (0.26, 0.5], ..., (0.74, 0.98], (0.019, 0.26], (0.26, 0.5], (0.74, 0.98], (0.5, 0.74]]
Length: 20
Categories (4, interval[float64]): [(0.019, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [131]:
# qcut是一个非常类似于cut的函数
# 它可以根据样本分位数对数据进行面元划分
# 根据数据的分布情况,cut可能无法使各个面元中含有相同数量的数据点
# 而qcut由于使用的是

In [132]:
data = np.random.randn(1000)

In [133]:
cats = pd.qcut(data,4)

In [134]:
cats

[(-0.00634, 0.638], (-0.00634, 0.638], (-0.00634, 0.638], (-3.718, -0.67], (-3.718, -0.67], ..., (-0.00634, 0.638], (-0.67, -0.00634], (-0.67, -0.00634], (-3.718, -0.67], (-0.00634, 0.638]]
Length: 1000
Categories (4, interval[float64]): [(-3.718, -0.67] < (-0.67, -0.00634] < (-0.00634, 0.638] < (0.638, 2.736]]

In [135]:
pd.value_counts(cats)

(0.638, 2.736]       250
(-0.00634, 0.638]    250
(-0.67, -0.00634]    250
(-3.718, -0.67]      250
dtype: int64

In [136]:
# 检测和过滤异常值

In [146]:
# 过滤或变换异常值很大程度上就是运用数组运算

In [147]:
data = pd.DataFrame(np.random.randn(1000,4))

In [149]:
data

            0         1         2         3
0   -0.124591 -1.428013  0.004460 -0.189828
1    1.405757  0.074084  1.570775  1.777525
2    1.628127  0.119796 -0.129867  0.438552
3   -0.735808 -2.009140 -0.947633  0.378856
4   -1.483346 -0.331657 -0.822548  0.744679
5    0.200733 -0.752328 -2.101334  1.752021
6   -1.354729 -0.181232  1.373901  0.498432
7   -0.301327  0.671443  0.436504  0.223814
8   -0.807916 -0.461804 -0.217092  0.051337
9    1.148644 -0.160871 -0.716921 -0.008390
10  -0.615353  1.340669  1.803993  0.857766
11   1.698671  0.447958 -1.160549 -0.005799
12  -0.994359  0.240920  1.766292  0.937407
13  -1.182686 -0.654319  0.274082  1.798734
14  -0.994066  1.350946 -0.067921  0.338148
15  -0.608671  1.089607  1.586394  2.598950
16   0.810818  0.861027 -1.104771  0.043354
17   1.748660  0.522716 -1.467842  1.285354
18  -1.094939 -0.487025 -0.373628  2.082858
19  -2.355707  0.053264 -0.796762  0.755241
20   2.136343  0.804544 -0.170707 -1.320544
21  -1.105292 -1.504079  0.330938  0.800335
22   2.083755  0.601973 -1.105281  1.681124
23  -0.467367 -0.816052  0.120147  0.246257
24   0.036250 -2.600589  0.201732 -0.291430
25  -1.111426 -0.984892  0.057887  0.032333
26   0.410607  0.003272  1.742524  0.476408
27  -0.157401  1.324413  0.549475 -0.516416
28   1.374161  0.234508  0.826601 -0.909450
29   3.714985  1.596009 -1.768301 -0.444637
..        ...       ...       ...       ...
970  0.380179  1.368382 -1.986567 -0.326612
971 -0.422332  1.184676  0.843563 -0.651349
972 -0.656240 -0.850223  0.327698  0.698256
973 -1.992196  0.020293 -1.309907  0.906357
974  0.489030 -1.554809 -0.857766 -0.360931
975  0.394371  0.052668  0.405475 -0.518222
976 -0.433676  0.326929  2.001884 -1.655484
977 -0.846177  0.836717 -1.493228 -0.311811
978  0.085719 -1.036824 -0.143632  1.152903
979  0.198473  0.582411  0.952014  0.078279
980  0.246651 -0.052359 -0.167615 -0.117878
981  0.757035  0.245188  1.795229  1.022427
982  2.906968 -1.336547 -3.339258 -1.168176
983  0.580767 -0.588995  2.781806 -0.065845
984  0.250799 -0.711441  0.041596 -1.122877
985  0.179338 -0.240902 -1.527493  0.467630
986 -0.291018 -1.123901  1.022670 -0.752300
987 -0.405962  0.832160  0.507413 -1.185487
988 -0.469043  0.685634  1.321844  0.472488
989  0.808550  0.038376 -0.177440 -0.072816
990 -0.290848  0.722430  0.497223  0.206957
991 -2.301191  1.645913 -0.047303 -0.580940
992 -0.936727 -0.195694 -0.631716 -0.386751
993 -1.872296 -0.576176 -2.251591  0.298584
994 -0.174340  0.946708  0.068964  0.015526
995 -0.048915 -1.133704  0.904334 -1.071252
996 -0.624322 -0.165348  2.159224 -1.504758
997  0.471077  0.739218  0.019585 -0.138512
998 -0.404987 -0.532802 -1.307568 -0.296821
999 -0.187905  1.315089 -1.361528 -0.827539

[1000 rows x 4 columns]

In [150]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.044245    -0.008466    -0.020178    -0.039087
std       1.003788     1.015190     1.023511     0.987074
min      -2.813395    -3.498305    -3.531757    -3.539857
25%      -0.625709    -0.660515    -0.723222    -0.684191
50%       0.048403    -0.045980     0.017103    -0.019229
75%       0.692627     0.701923     0.676341     0.607230
max       3.714985     3.271205     3.671364     3.734533

In [152]:
# 找出某列中绝对值大小超过3的值
col = data[2]

col[np.abs(col) > 3]

222   -3.012468
344    3.671364
687   -3.531757
982   -3.339258
Name: 2, dtype: float64

In [153]:
# 选出全部含有"超过3或-3的值"的行,使用any方法

In [157]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
29   3.714985  1.596009 -1.768301 -0.444637
113  3.640029 -0.941308 -0.404968  0.829555
207  0.148843  0.851870 -0.924212  3.434338
222  0.986023  0.553508 -3.012468  0.087273
344  0.869349 -0.560199  3.671364  0.716718
419 -0.576805  0.036792 -1.965122 -3.539857
526 -1.796996  0.793254  1.614417 -3.141096
607  0.973473  3.271205 -0.900016 -0.033780
682  0.395335 -3.498305  0.288846 -0.765922
687  0.526792 -1.122834 -3.531757 -0.251483
894  3.009086  0.552844  1.158082 -0.831210
928  0.625920  1.534272  0.968992  3.734533
982  2.906968 -1.336547 -3.339258 -1.168176

In [158]:
# 根据数据的值是正还是负,np.sign(data)可以生成1或者-1
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [160]:
# 所以可以通过下列代码将值限制在区间[-3,3]内

data[np.abs(data) > 3] = np.sign(data) * 3

In [161]:
data

            0         1         2         3
0   -0.124591 -1.428013  0.004460 -0.189828
1    1.405757  0.074084  1.570775  1.777525
2    1.628127  0.119796 -0.129867  0.438552
3   -0.735808 -2.009140 -0.947633  0.378856
4   -1.483346 -0.331657 -0.822548  0.744679
5    0.200733 -0.752328 -2.101334  1.752021
6   -1.354729 -0.181232  1.373901  0.498432
7   -0.301327  0.671443  0.436504  0.223814
8   -0.807916 -0.461804 -0.217092  0.051337
9    1.148644 -0.160871 -0.716921 -0.008390
10  -0.615353  1.340669  1.803993  0.857766
11   1.698671  0.447958 -1.160549 -0.005799
12  -0.994359  0.240920  1.766292  0.937407
13  -1.182686 -0.654319  0.274082  1.798734
14  -0.994066  1.350946 -0.067921  0.338148
15  -0.608671  1.089607  1.586394  2.598950
16   0.810818  0.861027 -1.104771  0.043354
17   1.748660  0.522716 -1.467842  1.285354
18  -1.094939 -0.487025 -0.373628  2.082858
19  -2.355707  0.053264 -0.796762  0.755241
20   2.136343  0.804544 -0.170707 -1.320544
21  -1.105292 -1.504079  0.330938  0.800335
22   2.083755  0.601973 -1.105281  1.681124
23  -0.467367 -0.816052  0.120147  0.246257
24   0.036250 -2.600589  0.201732 -0.291430
25  -1.111426 -0.984892  0.057887  0.032333
26   0.410607  0.003272  1.742524  0.476408
27  -0.157401  1.324413  0.549475 -0.516416
28   1.374161  0.234508  0.826601 -0.909450
29   3.000000  1.596009 -1.768301 -0.444637
..        ...       ...       ...       ...
970  0.380179  1.368382 -1.986567 -0.326612
971 -0.422332  1.184676  0.843563 -0.651349
972 -0.656240 -0.850223  0.327698  0.698256
973 -1.992196  0.020293 -1.309907  0.906357
974  0.489030 -1.554809 -0.857766 -0.360931
975  0.394371  0.052668  0.405475 -0.518222
976 -0.433676  0.326929  2.001884 -1.655484
977 -0.846177  0.836717 -1.493228 -0.311811
978  0.085719 -1.036824 -0.143632  1.152903
979  0.198473  0.582411  0.952014  0.078279
980  0.246651 -0.052359 -0.167615 -0.117878
981  0.757035  0.245188  1.795229  1.022427
982  2.906968 -1.336547 -3.000000 -1.168176
983  0.580767 -0.588995  2.781806 -0.065845
984  0.250799 -0.711441  0.041596 -1.122877
985  0.179338 -0.240902 -1.527493  0.467630
986 -0.291018 -1.123901  1.022670 -0.752300
987 -0.405962  0.832160  0.507413 -1.185487
988 -0.469043  0.685634  1.321844  0.472488
989  0.808550  0.038376 -0.177440 -0.072816
990 -0.290848  0.722430  0.497223  0.206957
991 -2.301191  1.645913 -0.047303 -0.580940
992 -0.936727 -0.195694 -0.631716 -0.386751
993 -1.872296 -0.576176 -2.251591  0.298584
994 -0.174340  0.946708  0.068964  0.015526
995 -0.048915 -1.133704  0.904334 -1.071252
996 -0.624322 -0.165348  2.159224 -1.504758
997  0.471077  0.739218  0.019585 -0.138512
998 -0.404987 -0.532802 -1.307568 -0.296821
999 -0.187905  1.315089 -1.361528 -0.827539

[1000 rows x 4 columns]

In [162]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.042880    -0.008239    -0.019966    -0.039575
std       0.999297     1.012754     1.018526     0.980880
min      -2.813395    -3.000000    -3.000000    -3.000000
25%      -0.625709    -0.660515    -0.723222    -0.684191
50%       0.048403    -0.045980     0.017103    -0.019229
75%       0.692627     0.701923     0.676341     0.607230
max       3.000000     3.000000     3.000000     3.000000

In [3]:
# 排列和随机取样
# 利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作
# permutation 随机重排序

In [4]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [5]:
sampler = np.random.permutation(5)

sampler

array([1, 2, 0, 3, 4])

In [6]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [8]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [13]:
# 随机return 3行
df.sample(n = 3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [14]:
# 另一种常用于统计建模或机器学习的转换方式
# 将分类变量转换为"哑变量"或"指标矩阵"

In [15]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
   .....:                    'data1': range(6)})

In [16]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [17]:
pd.get_dummies(df['key'],prefix='key')

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [18]:
df_with_dummy = df[['data1']]

In [19]:
df_with_dummy

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [20]:
# 字符串操作

# 字符串对象方法

In [21]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [22]:
# split 常与strip一起使用,以去除空白符

pieces = [x.strip() for x in val.split(',')]

In [23]:
pieces

['a', 'b', 'guido']

In [24]:
# 利用加法,可以将这些子字符串连接起来
first,sec,third = pieces
first + '::' + sec + "::" + 'third'

'a::b::third'

In [25]:
# 也可以使用join方法,传入一个列表或元组
'::'.join(pieces)

'a::b::guido'

In [26]:
val.replace(',','::')

'a::b:: guido'

In [27]:
val

'a,b, guido'

In [28]:
val.replace(',','')

'ab guido'

In [29]:
val.endswith('do')

True

In [30]:
# 正则表达式
# Python内置的re模块负责对字符串应用正则表达式
# re模块的函数分为三大类:模式匹配、替换以及拆分

In [31]:
# 描述一个或多个空白符的regex是\s+

import re
text = "foo      bar\t baz  \tqux"

In [33]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [34]:
# 可以使用re.compile自己编译regex得到一个可重用的regex对象

regex = re.compile('\s+')

In [35]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [36]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
   .....:         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [37]:
data = pd.Series(data)

In [38]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [39]:
data.str.get(0)

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object